/*A01
编写一个C程序，输出以下信息：
**********************************
   Thinking and Doing to Theory
**********************************
数＊号可看出，Thinking前面有3空格，Thinking前面的
*也是输出的一部分，别光打印字母!*/

/*A02
编写一个程序，输入a、b、c三个值，输出其中最大值。*/

/*A03
要将"China"译成密码，译码规律是：用原来字母后面的第4个字母代替原来的字母．
例如，字母"A"后面第4个字母是"E"．"E"代替"A"。
因此，"China"应译为"Glmre"。
请编一程序，用赋初值的方法使cl、c2、c3、c4、c5五个变量的值分别为，’C’、’h’、’i’、’n’、’a’，
经过运算，使c1、c2、c3、c4、c5分别变为’G’、’l’、’m’、’r’、’e’，并输出。*/

/*A04
设圆半径r，圆柱高h 求圆周长C1、圆面积Sa、圆球表面积Sb、圆球体积Va、圆柱体积Vb。 
用scanf输入数据，输出计算结果，输出时要求文字说明，取小数点后两位数字。请编程序。 
PI＝3.14*/

/*A05
输入一个华氏温度，要求输出摄氏温度。
公式为 c=5(F-32)/9 ，取位2小数。*/

/*A06
有三个整数a b c,由键盘输入，输出其中的最大的数。*/

/*A07
有一个函数
 y={ x      x<1
     | 2x-1   1<=x<10
     \ 3x-11  x>=10
写一段程序，输入x，输出y*/

/*A08
给出一百分制成绩，要求输出成绩等级‘A’、‘B’、‘C’、‘D’、‘E’。 
90分以上为A 80-89分为B 70-79分为C 60-69分为D 60分以下为E*/

/*A09
给出一个不多于5位的整数，
要求 1、求出它是几位数 
2、分别输出每一位数字 
3、按逆序输出各位数字，
例如原数为321,应输出123*/

/*A10
企业发放的奖金根据利润提成。
利润低于或等于100000元的，奖金可提10%;
利润高于100000元，低于200000元（100000<I≤200000）时，低于100000元的部分按10％提成，高于100000元的部分，可提成 7.5%;
200000<I≤400000时，低于200000元部分仍按上述办法提成，（下同），高于200000元沪範高既薨焕胳唯供沥的部分按5％提成；
400000<I≤600000元时，高于400000元的部分按3％提成；600000<I≤1000000时，高于600000元的部分按1.5%提成；
I>1000000时，超过1000000元的部分按1%提成。从键盘输入当月利润I,求应发奖金总数。*/

/*A11
输入两个正整数m和n，求其最大公约数和最小公倍数。*/

/*A12
输入一行字符，分别统计出其中英文字母、数字、空格和其他字符的个数。*/
