/*B01
求Sn=2+22+222+…+22…222（有n个2）之值。 
例如：2+22+222+2222+22222（n=5），n由键盘输入。(n<=6)*/

/*B02
求Sn=1!+2!+3!+4!+5!+…+n!之值，其中n是一个数字(n<=20)。*/

/*B03
求以下三数的和,保留2位小数 1~a之和 1~b的平方和 1~c的倒数和*/

/*B04
打印出所有"水仙花数"，所谓"水仙花数"是指一个三位数，其各位数字立方和等于该本身。 
例如：153是一个水仙花数，因为153=1^3+5^3+3^3。 
Output:
153
???
???
???*/

/*B05
一个数如果恰好等于它的因子之和，这个数就称为"完数"。 
例如，6的因子为1、2、3，而6=1+2+3，因此6是"完数"。
编程序找出N之内的所有完数，并按下面格式输出其因子：*/

/*B06
有一分数序列： 2/1 3/2 5/3 8/5 13/8 21/13...... 
求出这个数列的前N项之和，保留两位小数。*/

/*B07
一球从M米高度自由下落，每次落地后返回原高度的一半，再落下。 
它在第N次落地时反弹多高？共经过多少米？ 保留两位小数*/

/*B08
猴子吃桃问题。
猴子第一天摘下若干个桃子，当即吃了一半，还不过瘾，又多吃了一个。 
第二天早上又将剩下的桃子吃掉一半，又多吃一个。
以后每天早上都吃了前一天剩下的一半零一个。 
到第N天早上想再吃时，见只剩下一个桃子了。求第一天共摘多少桃子。*/

/*B09
用迭代法求 。求平方根的迭代公式为： X[n+1]=1/2(X[n]+a/X[n])
要求前后两次求出的得差的绝对值少于0.00001。 输出保留3位小数*/

/*B10
用筛法求之N内的素数。*/

/*B11
用选择法对10个整数从小到大排序。*/

/*B12
求一个3×3矩阵对角线元素之和。*/

/*B13
已有一个已排好的9个元素的数组，今输入一个数要求按原来排序的规律将它插入数组中。*/

/*B14
输入10个数字，然后逆序输出。*/
