/*C01
写两个函数，分别求两个整数的最大公约数和最小公倍数，用主函数调用这两个函数，并输出结果两个整数由键盘输入。*/

/*C02
求方程 的根，用三个函数分别求当b^2-4ac大于0、等于0、和小于0时的根，并输出结果。
从主函数输入a、b、c的值。*/

/*C03
写一个判断素数的函数，在主函数输入一个整数，输出是否是素数的消息。*/

/*C04
写一个函数，使给定的一个二维数组（３×３）转置，即行列互换。*/

/*C05
写一函数，使输入的一个字符串按反序存放，在主函数中输入输出反序后的字符串。*/

/*C06
写一函数，将两个字符串连接*/

/*C07
写一函数，将两个字符串中的元音字母（保证小写）复制到另一个字符串，然后输出。*/

/*C08
写一函数，输入一个四位数字，要求输出这四个数字字符，但每两个数字间空格。如输入1990，应输出"1 9 9 0"。*/

/*C09
编写一函数，由实参传来一个字符串，统计此字符串中字母、数字、空格和其它字符的个数，在主函数中输入字符串以及输出上述结果。 
只要结果，别输出什么提示信息。*/

/*C10
定义一个带参的宏，使两个参数的值互换，并写出程序，输入两个数作为使用宏时的实参。
输出已交换后的两个值。*/

/*C11
输入两个整数，求他们相除的余数。用带参的宏来实现，编程序。*/

/*C12
三角形面积=SQRT(S*(S-a)*(S-b)*(S-c)) 其中S=(a+b+c)/2，a、b、c为三角形的三边。 
定义两个带参的宏，一个用来求area， 另一个宏用来求S。
写程序，在程序中用带实参的宏名来求面积area。*/

/*C13
给年份year，定义一个宏，以判别该年份是否闰年。
提示：宏名可以定义为LEAP_YEAR，形参为y，
既定义宏的形式为 #define LEAP_YEAR(y) （读者设计的字符串）*/

/*C14
请设计输出实数的格式，
包括：⑴一行输出一个实数；⑵一行内输出两个实数；⑶一行内输出三个实数。
实数用"6.2f"格式输出。*/

/*C15
分别用函数和带参的宏，从三个数中找出最大的数。*/
