/*D01
输入一行电报文字，将字母变成其下一字母（如’a’变成’b’……’z’变成’ａ’其它字符不变）。*/

/*D02
输入三个整数，按由小到大的顺序输出。*/

/*D03
输入三个字符串，按由小到大的顺序输出*/

/*D04
输入10个不相同的整数，将其中最小的数与第一个数对换，把最大的数与最后一个数对换。
写三个函数； ①输入10个数；②进行处理；③输出10个数。*/

/*D05
有n个整数，使前面各数顺序向后移m个位置，最后m个数变成前面m个数，见图。
写一函数：实现以上功能，在主函数中输入n个数和输出调整后的n个数。*/

/*D06
有n人围成一圈，顺序排号。从第1个人开始报数（从1到3报数），
凡报到3的人退出圈子，问最后留下的是原来的第几号的那位。*/

/*D07
有一字符串，包含n个字符。写一函数，
将此字符串中从第m个字符开始的全部字符复制成为另一个字符串。*/

/*D08
定义一个结构体变量（包括年、月、日）。计算该日在本年中是第几天，注意闰年问题。*/

/*D09
现有有N个学生的数据记录，每个记录包括学号、姓名、三科成绩。 
编写一个函数input,用来输入一个学生的数据记录。 
编写一个函数print,打印一个学生的数据记录。 
在主函数调用这两个函数，读取N条记录输入，再按要求输出。 N<100*/

/*D10
有N个学生，每个学生的数据包括学号、姓名、3门课的成绩，
从键盘输入N个学生的数据，要求打印出3门课的总平均成绩，
以及最高分的学生的数据（包括学号、姓名、3门课成绩）*/

/*D11
已有a、b两个链表，每个链表中的结点包括学好、成绩。
要求把两个链表合并，按学号升序排列。*/
