/*B05
一个数如果恰好等于它的因子之和，这个数就称为"完数"。
例如，6的因子为1、2、3，而6=1+2+3，因此6是"完数"。
编程序找出N之内的所有完数，并按下面格式输出其因子：*/

//#include <stdio.h>
//#include <math.h>
//int main()
//{
//	//输入一个数
//	//查找这个数的所有因子
//	//判断是不是完数
//	//输出因子
//	int n = 0;
//	int sum = 0;
//	scanf_s("%d", &n);
//	for (n; n > 0; n--)
//	{
//		int sum = 0;
//
//	   for (int i = 1; i < n; i++)
//	   {
//		if (n % i == 0)
//		{
////			printf("n的因子：%d", i);
//			sum += i;
//	    }
//	   }
//
//	  if (sum == n)
//	  {
//		printf("n=%d是完数\n",n);
//	  }
//	}
//	return 0;
//}