/*A09
给出一个不多于5位的整数，
要求 1、求出它是几位数
2、分别输出每一位数字
3、按逆序输出各位数字，
例如原数为321,应输出123*/
//int main()
//{
//	int num = 0;
//	restart: printf("请输入一个不多于5位的整数：");
//	scanf_s("%d", &num);
//	if (num <= -99999 || num >= 99999)
//	{
//		printf("输入错误，请重新输入\n");
//		goto restart;
//	}
//	if(num/10==0)
//	{
//		printf("个位数\n");
//		printf("个位上的数字为：%d\n",num);
//		printf("按逆序输出各位上的数字：%d\n",num);
//	}
//	else if (num / 100 == 0)
//	{
//		printf("两位数\n");
//        printf("十位上的数字为：%d\n", num / 10);
//        printf("个位上的数字为：%d\n", num % 10);
//		printf("按逆序输出各位上的数字：个位数上的数：%d 十位上的数：%d\n",num%10 ,num/10);
//	}
//	else if (num / 1000 == 0)
//	{
//		printf("三位数\n");
//		printf("百位上的数字为：%d\n", num / 100);
//		printf("十位上的数字为：%d\n", num / 10 % 10);
//		printf("个位上的数字为：%d\n", num % 10);
//		printf("按逆序输出各位上的数字：个位数上的数：%d 十位上的数：%d 百位数上的数：%d\n",num % 10 , num / 10 % 10,num / 100 );
//	}
//	else if (num / 10000 == 0)
//	{
//		printf("四位数\n");
//        printf("千位上的数字为：%d\n", num / 1000);
//        printf("百位上的数字为：%d\n", num / 100 % 10);
//        printf("十位上的数字为：%d\n", num / 10 % 10);
//        printf("个位上的数字为：%d\n", num % 10);
//		printf("按逆序输出各位上的数字： 个位数上的数：%d 十位上的数：%d 百位数上的数：%d  千位上的数字：%d\n",num % 10 ,num / 10 % 10 ,num / 100 % 10 , num / 1000);
//
//	}
//	else if (num / 10000 != 0)
//	{
//		printf("五位数\n");
//        printf("万位上的数字为：%d\n", num / 10000);
//        printf("千位上的数字为：%d\n", num / 1000 % 10);
//        printf("百位上的数字为：%d\n", num / 100 % 10);
//        printf("十位上的数字为：%d\n", num / 10 % 10);
//		printf("个位上的数字为：%d\n", num % 10);
//		printf("按逆序输出各位上的数字：个位数上的数：%d 十位上的数：%d 百位数上的数：%d 千位上的数字：%d 万位上的数字：%d\n",num%10 ,num /10%10 , num / 100 % 10,num / 1000 % 10 ,num / 10000);
//
//	}
//
//	return 0;
//}